<template>
    <svg
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        xmlns:xlink="http://www.w3.org/1999/xlink"
        x="0px"
        y="0px"
        viewBox="0 0 16 16"
        style="enable-background: new 0 0 16 16"
        xml:space="preserve"
    >
        <g id="图层_4">
            <path
                id="形状结合"
                class="st"
                d="M3.9,10.6c0.6,0,1,0.4,1,1V14c0,0.6-0.4,1-1,1H1.5c-0.6,0-1-0.4-1-1v-2.4c0-0.6,0.4-1,1-1
		H3.9z M9.2,10.6c0.6,0,1,0.4,1,1V14c0,0.6-0.4,1-1,1H6.8c-0.6,0-1-0.4-1-1v-2.4c0-0.6,0.4-1,1-1H9.2z M14.6,10.6c0.6,0,1,0.4,1,1
		V14c0,0.6-0.4,1-1,1h-2.4c-0.6,0-1-0.4-1-1v-2.4c0-0.6,0.4-1,1-1H14.6z M8.6,5.3l0,1.9l4.8,0c0.2,0,0.4,0.2,0.4,0.4l0,0.1v2.1
		c0,0.2-0.2,0.4-0.4,0.4c-0.2,0-0.4-0.2-0.4-0.4l0-0.1l0-1.6L8.6,8l0,1.6c0,0.2-0.2,0.4-0.5,0.4c-0.2,0-0.4-0.2-0.5-0.4l0-0.1l0-1.6
		L3.1,8l0,1.6c0,0.2-0.2,0.4-0.4,0.4l-0.1,0c-0.2,0-0.4-0.2-0.4-0.4l0-0.1V7.6c0-0.2,0.2-0.4,0.4-0.4l0.1,0l4.9,0l0-1.9H8.6z"
            />
        </g>
        <g id="图层_3_1_">
            <path
                id="矩形"
                class="st"
                d="M6.8,0.8h2.4c0.6,0,1,0.4,1,1v2.4c0,0.6-0.4,1-1,1H6.8c-0.6,0-1-0.4-1-1V1.8
		C5.8,1.3,6.2,0.8,6.8,0.8z"
            />
        </g>
    </svg>
</template>
<script>
export default {
    name: "LsIconTask",
};
</script>
<style lang="scss" scoped>
path {
    fill: $navIconDefaultColor;
}
</style>
