<template>
    <svg
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        xmlns:xlink="http://www.w3.org/1999/xlink"
        x="0px"
        y="0px"
        viewBox="0 0 16 16"
        style="enable-background: new 0 0 16 16"
        xml:space="preserve"
    >
        <g id="图层_4">
            <path
                id="形状结合"
                class="st"
                d="M15,11.6c0.6,0,1,0.4,1,1v0.1c0,0.6-0.4,1-1,1H2.1c-0.6,0-1-0.4-1-1v-0.1c0-0.6,0.4-1,1-1
		H15z M14.1,8.9c0.3,0,0.5,0.2,0.5,0.5c0,0.3-0.2,0.5-0.4,0.5l-0.1,0H8c-0.3,0-0.5-0.2-0.5-0.5c0-0.3,0.2-0.5,0.4-0.5l0.1,0H14.1z
		 M13.8,2.5c0.3,0,0.5,0.2,0.5,0.5c0,0.3-0.2,0.5-0.4,0.5l-0.1,0h-1.7c-0.3,0-0.5-0.2-0.5-0.5c0-0.3,0.2-0.5,0.4-0.5l0.1,0H13.8z"
            />
        </g>
        <g id="图层_3">
            <path
                id="形状结合_1_"
                class="st"
                d="M7.9,2.3c0.4,0,0.8,0.4,0.8,0.8c0,0.4-0.3,0.7-0.7,0.8l-0.1,0H5.7l0,5.5
		c0,0.4-0.4,0.8-0.8,0.8c-0.4,0-0.7-0.3-0.8-0.7l0-0.1l0-5.5H1.6c-0.4,0-0.8-0.4-0.8-0.8c0-0.4,0.3-0.7,0.7-0.8l0.1,0H7.9z
		 M13.8,5.7c0.3,0,0.5,0.2,0.5,0.5c0,0.3-0.2,0.5-0.4,0.5l-0.1,0h-3.7l0,0c-0.3,0-0.5-0.2-0.5-0.5C9.6,6,9.8,5.8,10,5.7l0.1,0H13.8z
		"
            />
        </g>
    </svg>
</template>
<script>
export default {
    name: "LsIconContext",
};
</script>
<style lang="scss" scoped>
path {
    fill: $navIconDefaultColor;
}
</style>
